{
  "model_name": "sequential",
  "layers": [
    {
      "name": "conv2d",
      "type": "Conv2D",
      "input_shape": null,
      "output_shape": null,
      "config": {
        "name": "conv2d",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "filters": 1,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "valid",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "groups": 1,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "weight_file": "weights\\conv2d_weights.csv",
      "bias_file": "biases\\conv2d_biases.csv"
    },
    {
      "name": "max_pooling2d",
      "type": "MaxPooling2D",
      "input_shape": null,
      "output_shape": null,
      "config": {
        "name": "max_pooling2d",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "pool_size": [
          2,
          2
        ],
        "padding": "valid",
        "strides": [
          2,
          2
        ],
        "data_format": "channels_last"
      },
      "weight_file": null,
      "bias_file": null
    },
    {
      "name": "flatten",
      "type": "Flatten",
      "input_shape": null,
      "output_shape": null,
      "config": {
        "name": "flatten",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "data_format": "channels_last"
      },
      "weight_file": null,
      "bias_file": null
    },
    {
      "name": "dense",
      "type": "Dense",
      "input_shape": null,
      "output_shape": null,
      "config": {
        "name": "dense",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "units": 64,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "weight_file": "weights\\dense_weights.csv",
      "bias_file": "biases\\dense_biases.csv"
    },
    {
      "name": "dense_1",
      "type": "Dense",
      "input_shape": null,
      "output_shape": null,
      "config": {
        "name": "dense_1",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "units": 32,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "weight_file": "weights\\dense_1_weights.csv",
      "bias_file": "biases\\dense_1_biases.csv"
    },
    {
      "name": "dense_2",
      "type": "Dense",
      "input_shape": null,
      "output_shape": null,
      "config": {
        "name": "dense_2",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "units": 10,
        "activation": "softmax",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "weight_file": "weights\\dense_2_weights.csv",
      "bias_file": "biases\\dense_2_biases.csv"
    }
  ]
}